Revit 2016 API
UIView.ZoomToFit Method
Zoom the view to fit its contents.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public void ZoomToFit()
Visual Basic
Public Sub ZoomToFit
Visual C++
public:
void ZoomToFit()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | The view is not a graphical view.
See Also
UIView Class
Autodesk.Revit.UI Namespace